In [21]:
people = {
    'first':['Charan','Amit','Yash'],
    'last' :['Shetty','Trivedi','Patel'],
    'email':['cshetty@etech.medallia.com','atrivedi@etech.medallia.com','ypatel@etech.medallia.com']
}

In [22]:
import pandas as pd
df = pd.DataFrame(people)
df

    first     last                        email
0  Charan   Shetty   cshetty@etech.medallia.com
1    Amit  Trivedi  atrivedi@etech.medallia.com
2    Yash    Patel    ypatel@etech.medallia.com

In [23]:
df['full name'] = df['first']+' '+df['last']
df

    first     last                        email      full name
0  Charan   Shetty   cshetty@etech.medallia.com  Charan Shetty
1    Amit  Trivedi  atrivedi@etech.medallia.com   Amit Trivedi
2    Yash    Patel    ypatel@etech.medallia.com     Yash Patel

In [24]:
df.drop(columns=['first','last'],inplace=True)
df

                         email      full name
0   cshetty@etech.medallia.com  Charan Shetty
1  atrivedi@etech.medallia.com   Amit Trivedi
2    ypatel@etech.medallia.com     Yash Patel

In [25]:
df['full name'].str.split(' ')

0    [Charan, Shetty]
1     [Amit, Trivedi]
2       [Yash, Patel]
Name: full name, dtype: object

In [26]:
df['full name'].str.split(' ',expand=True)

        0        1
0  Charan   Shetty
1    Amit  Trivedi
2    Yash    Patel

In [27]:
df[['first','last']]=df['full name'].str.split(' ',expand=True)

In [28]:
df

                         email      full name   first     last
0   cshetty@etech.medallia.com  Charan Shetty  Charan   Shetty
1  atrivedi@etech.medallia.com   Amit Trivedi    Amit  Trivedi
2    ypatel@etech.medallia.com     Yash Patel    Yash    Patel

In [29]:
df.append({'first':'Tony'},ignore_index=True)

                         email      full name   first     last
0   cshetty@etech.medallia.com  Charan Shetty  Charan   Shetty
1  atrivedi@etech.medallia.com   Amit Trivedi    Amit  Trivedi
2    ypatel@etech.medallia.com     Yash Patel    Yash    Patel
3                          NaN            NaN    Tony      NaN

In [31]:
df2 = pd.DataFrame(people)
df2

   first    last     full name                       email
0   Tony   Stark    Tony Stark   tstark@etech.medallia.com
1  Chris  Rogers  Chris Rogers  crogers@etech.medallia.com

In [32]:
df = df.append(df2,ignore_index=True)
df

                         email      full name   first     last
0   cshetty@etech.medallia.com  Charan Shetty  Charan   Shetty
1  atrivedi@etech.medallia.com   Amit Trivedi    Amit  Trivedi
2    ypatel@etech.medallia.com     Yash Patel    Yash    Patel
3    tstark@etech.medallia.com     Tony Stark    Tony    Stark
4   crogers@etech.medallia.com   Chris Rogers   Chris   Rogers

In [33]:
df.drop(index=4)

                         email      full name   first     last
0   cshetty@etech.medallia.com  Charan Shetty  Charan   Shetty
1  atrivedi@etech.medallia.com   Amit Trivedi    Amit  Trivedi
2    ypatel@etech.medallia.com     Yash Patel    Yash    Patel
3    tstark@etech.medallia.com     Tony Stark    Tony    Stark

In [34]:
df

                         email      full name   first     last
0   cshetty@etech.medallia.com  Charan Shetty  Charan   Shetty
1  atrivedi@etech.medallia.com   Amit Trivedi    Amit  Trivedi
2    ypatel@etech.medallia.com     Yash Patel    Yash    Patel
3    tstark@etech.medallia.com     Tony Stark    Tony    Stark
4   crogers@etech.medallia.com   Chris Rogers   Chris   Rogers

In [35]:
df.drop(index=4,inplace=True)

In [36]:
df

                         email      full name   first     last
0   cshetty@etech.medallia.com  Charan Shetty  Charan   Shetty
1  atrivedi@etech.medallia.com   Amit Trivedi    Amit  Trivedi
2    ypatel@etech.medallia.com     Yash Patel    Yash    Patel
3    tstark@etech.medallia.com     Tony Stark    Tony    Stark

In [37]:
filt=df['last']=='Trivedi'
df.drop(index=df[filt].index,inplace=True)

In [38]:
df

                        email      full name   first    last
0  cshetty@etech.medallia.com  Charan Shetty  Charan  Shetty
2   ypatel@etech.medallia.com     Yash Patel    Yash   Patel
3   tstark@etech.medallia.com     Tony Stark    Tony   Stark